## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 3 to change, 14 to destroy.</code></pre>

* Update
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_service_principal.sp
* Replace
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_storage_account.sa




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-ARCHIVING-PROD"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/c61432c17d56e56ef2b07kv"
        name                            = "c61432c17d56e56ef2b07kv"
      ~ tags                            = {
          ~ "application"  = "bais" -> "archiving-with-records-management"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DTS-ARCHIVING-PROD"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-prod-rg/providers/Microsoft.Storage/storageAccounts/c61432c17d56e56ef2b07sa"
        name                              = "c61432c17d56e56ef2b07sa"
      ~ tags                              = {
          ~ "application"  = "bais" -> "archiving-with-records-management"
            # (4 unchanged elements hidden)
        }
        # (36 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azuread_group_member.members["Contributor-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "f721155a-fb16-492a-82bc-e7b64e95732e/member/63469462-b784-42e8-8a66-20a8840ac84a" -> (known after apply)
      ~ member_object_id = "63469462-b784-42e8-8a66-20a8840ac84a" -> "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azuread_group_member.members["Key Vault Administrator-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "1d66bf03-b528-46bb-8160-ba155e5fbebb/member/63469462-b784-42e8-8a66-20a8840ac84a" -> (known after apply)
      ~ member_object_id = "63469462-b784-42e8-8a66-20a8840ac84a" -> "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Backup",
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "Recover",
                  - "Restore",
                  - "SetIssuers",
                  - "Update",
                ]
              - key_permissions         = [
                  - "Backup",
                  - "Create",
                  - "Decrypt",
                  - "Delete",
                  - "Encrypt",
                  - "Get",
                  - "Import",
                  - "List",
                  - "Recover",
                  - "Restore",
                  - "Sign",
                  - "UnwrapKey",
                  - "Update",
                  - "Verify",
                  - "WrapKey",
                ]
              - object_id               = "f721155a-fb16-492a-82bc-e7b64e95732e"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                  - "List",
                  - "Delete",
                  - "Restore",
                  - "Recover",
                  - "Backup",
                ]
              - storage_permissions     = [
                  - "Backup",
                  - "Delete",
                  - "DeleteSAS",
                  - "Get",
                  - "GetSAS",
                  - "List",
                  - "ListSAS",
                  - "Recover",
                  - "RegenerateKey",
                  - "Restore",
                  - "Set",
                  - "SetSAS",
                  - "Update",
                ]
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply)
        name                            = "ccad00eded34a1e94ef76kv"
      ~ resource_group_name             = "azure-control-stg-rg" -> "azure-control-test-rg" # forces replacement
      ~ tags                            = {
          ~ "application"  = "bais" -> "archiving-with-records-management"
          ~ "criticality"  = "High" -> "Medium"
          ~ "environment"  = "staging" -> "testing"
            # (2 unchanged elements hidden)
        }
      ~ vault_uri                       = "https://ccad00eded34a1e94ef76kv.vault.azure.net/" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ network_acls {
          ~ bypass                     = "AzureServices" -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
        }
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault_access_policy.permissions must be replaced
-/+ resource "azurerm_key_vault_access_policy" "permissions" {
      ~ id                      = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/objectId/f721155a-fb16-492a-82bc-e7b64e95732e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault_secret.aks_admin_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      ~ id                      = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/aks-admin-rbac-group-id/50d6a2749d8e4b35bd5c69b34298c491" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply) # forces replacement
        name                    = "aks-admin-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/aks-admin-rbac-group-id/versions/50d6a2749d8e4b35bd5c69b34298c491" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/aks-admin-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "50d6a2749d8e4b35bd5c69b34298c491" -> (known after apply)
      ~ versionless_id          = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/aks-admin-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault_secret.aks_user_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_user_group_id" {
      ~ id                      = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/aks-user-rbac-group-id/4e04ac618aa94de0bb283e034c15f918" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply) # forces replacement
        name                    = "aks-user-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/aks-user-rbac-group-id/versions/4e04ac618aa94de0bb283e034c15f918" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/aks-user-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "4e04ac618aa94de0bb283e034c15f918" -> (known after apply)
      ~ versionless_id          = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/aks-user-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault_secret.sp_app_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_app_id" {
      ~ id                      = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/sp-application-id/16372a810d6a480fbe2071a9ca7de277" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply) # forces replacement
        name                    = "sp-application-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/sp-application-id/versions/16372a810d6a480fbe2071a9ca7de277" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/sp-application-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "16372a810d6a480fbe2071a9ca7de277" -> (known after apply)
      ~ versionless_id          = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/sp-application-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault_secret.sp_object_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_object_id" {
      ~ id                      = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/sp-object-id/4339a4f3f5034da29ede632a1888eb5a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply) # forces replacement
        name                    = "sp-object-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/sp-object-id/versions/4339a4f3f5034da29ede632a1888eb5a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/sp-object-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "4339a4f3f5034da29ede632a1888eb5a" -> (known after apply)
      ~ versionless_id          = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/sp-object-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault_secret.sp_token must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_token" {
      - content_type            = "" -> null
      ~ id                      = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/sp-token/5f08df061afa496987d39c73725fb9e2" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply) # forces replacement
        name                    = "sp-token"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/sp-token/versions/5f08df061afa496987d39c73725fb9e2" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/secrets/sp-token" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "5f08df061afa496987d39c73725fb9e2" -> (known after apply)
      ~ versionless_id          = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/sp-token" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv/providers/Microsoft.Authorization/roleAssignments/ac55546a-953d-05cd-f01a-a042c62894e0" -> (known after apply)
      ~ name                             = "ac55546a-953d-05cd-f01a-a042c62894e0" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/f25e0fa2-a7c8-4377-a976-54943a77a395" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/ccad00eded34a1e94ef76kv" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/ccad00eded34a1e94ef76sa/providers/Microsoft.Authorization/roleAssignments/fae0d018-89f8-1015-3ec9-826468d0a5e4" -> (known after apply)
      ~ name                             = "fae0d018-89f8-1015-3ec9-826468d0a5e4" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/ccad00eded34a1e94ef76sa" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/ccad00eded34a1e94ef76sa/providers/Microsoft.Authorization/roleAssignments/1b637394-152b-d02d-0bc3-8bb993adc7ee" -> (known after apply)
      ~ name                             = "1b637394-152b-d02d-0bc3-8bb993adc7ee" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/ccad00eded34a1e94ef76sa" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/cad00ede-36df-4e04-ad0b-d34a1e94ef76/providers/Microsoft.Authorization/roleAssignments/326fb367-1d94-914e-1619-1340095146ea" -> (known after apply)
      ~ name                             = "326fb367-1d94-914e-1619-1340095146ea" -> (known after apply)
      ~ principal_id                     = "63469462-b784-42e8-8a66-20a8840ac84a" -> "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/cad00ede-36df-4e04-ad0b-d34a1e94ef76/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_storage_account.sa must be replaced
-/+ resource "azurerm_storage_account" "sa" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.Storage/storageAccounts/ccad00eded34a1e94ef76sa" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "ccad00eded34a1e94ef76sa"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://ccad00eded34a1e94ef76sa.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "ccad00eded34a1e94ef76sa.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://ccad00eded34a1e94ef76sa.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "ccad00eded34a1e94ef76sa.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://ccad00eded34a1e94ef76sa.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "ccad00eded34a1e94ef76sa.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://ccad00eded34a1e94ef76sa.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "ccad00eded34a1e94ef76sa.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://ccad00eded34a1e94ef76sa.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "ccad00eded34a1e94ef76sa.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://ccad00eded34a1e94ef76sa.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "ccad00eded34a1e94ef76sa.z33.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "azure-control-stg-rg" -> "azure-control-test-rg" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      ~ tags                              = {
          ~ "application"  = "bais" -> "archiving-with-records-management"
          ~ "criticality"  = "High" -> "Medium"
          ~ "environment"  = "staging" -> "testing"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled           = false -> (known after apply)
          ~ change_feed_retention_in_days = 0 -> (known after apply)
          + default_service_version       = (known after apply)
          ~ last_access_time_enabled      = false -> (known after apply)
          ~ versioning_enabled            = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.subscription["HMCTS-SOC-PROD"].azuread_service_principal.sp will be updated in-place
  ~ resource "azuread_service_principal" "sp" {
        id                           = "648f0570-28bd-4b0c-887d-85e6f91d7db8"
      ~ owners                       = [
          - "4543a096-a913-4550-8c8d-99fdb0a60881",
        ]
        tags                         = []
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 14 to add, 3 to change, 14 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.subscription["DTS-ARCHIVING-TEST"].azuread_group.groups["Contributor"] has changed
  ~ resource "azuread_group" "groups" {
        id                         = "f721155a-fb16-492a-82bc-e7b64e95732e"
      ~ members                    = [
          + "1473c96f-947a-4303-88bc-fb42beae7b1c",
            # (4 unchanged elements hidden)
        ]
        # (18 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azuread_group.groups["Owner"] has changed
  ~ resource "azuread_group" "groups" {
        id                         = "8a1b3ca7-e5fe-446c-9a24-5742edde650e"
      ~ members                    = [
          - "69eb3193-44e2-4277-8376-c1e185f00765",
          + "af9268a1-154f-4d99-8b47-7b139ef8f79e",
            # (1 unchanged element hidden)
        ]
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":63,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->